{
  "name": "projects/560805672913/locations/europe-west3/instances/3e220ed9-5c8d-42db-a940-1880ad360566/rules/ru_99491a1c-19b9-4165-9d36-11b0a903c249",
  "revisionId": "v_1748450844_743103000",
  "displayName": "Compromised_Credentials_alerts",
  "text": "\nrule Compromised_Credentials_alerts {\n  meta:\n    author = \"TCS MDR practice\"\n    description = \"Mandiant DTM Compromised Credential\"\n    severity = \"Medium\"\n  events:\n    $dtm.extracted.fields[\"alert_type\"] != \"Compromised Credentials\"\n    $dtm.extracted.fields[\"severity\"] = \"high\" OR $dtm.extracted.fields[\"severity\"] = \"medium\"\n  outcome:\n    $alert_type = $dtm.extracted.fields[\"alert_type\"]\n    $log_type = $dtm.metadata.log_type\n    $confidence_score = $dtm.extracted.fields[\"confidence\"]\n    $action = array($dtm.security_result.action)\n    $discovered_domain = array($dtm.extracted.fields[\"topics[0].value\"])\n  condition:\n    $dtm\n}\n",
  "author": "TCS MDR practice",
  "severity": {
    "displayName": "Medium"
  },
  "metadata": {
    "description": "Mandiant DTM Compromised Credential"
  },
  "createTime": "2025-05-28T16:19:16.574863Z",
  "revisionCreateTime": "2025-05-28T16:47:24.743103Z",
  "compilationState": "SUCCEEDED",
  "type": "SINGLE_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "CJz83MEGEJi0q+IC",
  "nearRealTimeLiveRuleEligible": true,
  "inputsUsed": {
    "usesUdm": true
  }
}