{
  "name": "projects/560805672913/locations/europe-west3/instances/3e220ed9-5c8d-42db-a940-1880ad360566/rules/ru_adec3520-bf7c-42f6-93a7-7e240712af48",
  "revisionId": "v_1748275734_649199000",
  "displayName": "high_medium_severity_alerts_for_newDomain_Discovery",
  "text": "\nrule high_medium_severity_alerts_for_newDomain_Discovery {\n  meta:\n    author = \"TCS MDR practice\"\n    description = \"Mandiant DTM high and medium severity for new Domain Discovery\"\n    severity = \"High\"\n  events:\n    $dtm.extracted.fields[\"alert_type\"] = \"Domain Discovery\"\n    $dtm.extracted.fields[\"severity\"] = \"high\" OR $dtm.extracted.fields[\"severity\"] = \"medium\"\n  outcome:\n    $alert_type = $dtm.extracted.fields[\"alert_type\"]\n    $log_type = $dtm.metadata.log_type\n    $confidence_score = $dtm.extracted.fields[\"confidence\"]\n    $action = array($dtm.security_result.action)\n    $discovered_domain = array($dtm.extracted.fields[\"topics[0].value\"])\n  condition:\n    $dtm\n}\n",
  "author": "TCS MDR practice",
  "severity": {
    "displayName": "High"
  },
  "metadata": {
    "description": "Mandiant DTM high and medium severity for new Domain Discovery"
  },
  "createTime": "2025-05-26T15:31:54.985311Z",
  "revisionCreateTime": "2025-05-26T16:08:54.649199Z",
  "compilationState": "SUCCEEDED",
  "type": "SINGLE_EVENT",
  "allowedRunFrequencies": [
    "LIVE",
    "HOURLY",
    "DAILY"
  ],
  "etag": "CJak0sEGEJj7x7UC",
  "nearRealTimeLiveRuleEligible": true,
  "inputsUsed": {
    "usesUdm": true
  }
}